01  WS-AREA-1 PIC X(100). 01  WS-AREA-2 PIC 9(5) VALUE 0.  MOVE 'Some data' TO WS-AREA-1.  ADD 1 TO WS-AREA-2.  IF WS-AREA-2 > 10 THEN PERFORM 100-PROCESS-DATA END-IF.